-- artists
INSERT INTO Artist (name, count_likes, count_followers, count_listening)
VALUES ('Queen', 0, 0, 0),
       ('Дайте танк (!)', 0, 0, 0),
       ('Pink Floyd', 0, 0, 0),
       ('Валерий Меладзе', 0, 0, 0),
       ('Валентин Стрыкало', 0, 0, 0),
       ('Twenty One Pilots', 0, 0, 0),
       ('Химера', 0, 0, 0),
       ('Дора', 0, 0, 0),
       ('Shortparis', 0, 0, 0),
       ('R.E.M', 0, 0, 0),
       ('50Cent', 0, 0, 0),
       ('Eminem', 0, 0, 0),
       ('Imagine Dragons', 0, 0, 0),
       ('Kendrick Lamar', 0, 0, 0),
       ('Linkin Park', 0, 0, 0),
       ('Би-2', 0, 0, 0),
       ('Мальбэк & Сюзанна', 0, 0, 0),
       ('Алла Пугачева', 0, 0, 0);

-- -- albums
INSERT INTO Album (title, artist_id, count_likes, count_listening, date)
VALUES ('A Night At The Opera', 1, 0, 0, 1975),
       ('Человеко-часы', 2, 0, 0, 2020),
       ('The Dark Side of the Moon', 3, 0, 0, 1973),
       ('Вопреки', 4, 0, 0, 2008),
       ('Часть чего-то большего', 5, 0, 0, 2013),
       ('Blurryface', 6, 0, 0, 2015),
       ('ZUDWA-DWA', 7, 0, 0, 2003),
       ('Младшая сестра', 8, 0, 0, 2019),
       ('Так закалялась сталь', 9, 0, 0, 2019),
       ('Out Of Time', 10, 0, 0, 2019),
       ('Animal Ambition', 11, 0, 0, 2014),
       ('I am Marshall', 12, 0, 0, 2008),
       ('Recovery', 12, 0, 0, 2010),
       ('Mercury (Act 1)', 13, 0, 0, 2021),
       ('Origins', 13, 0, 0, 2018),
       ('Smoke + Mirrors', 13, 0, 0, 2014),
       ('Mr. Morale & The Big Steppers', 14, 0, 0, 2022),
       ('Minutes to Midnight', 14, 0, 0, 2007),
       ('One more light', 14, 0, 0, 2017),
       ('Горизонт событий', 15, 0, 0, 2017),
       ('Думаешь, это конец?', 16, 0, 0, 2020),
       ('Синглы', 17, 0, 0, 2000);

-- -- album covers
INSERT
INTO AlbumCover (quote, is_dark)
VALUES ('Deluxe Edition 2011 Remaster', false),
       ('Нельзя в апокалипсис петь о том, как ты устал ходить на работу', true),
       ('This correlates with the inner world of a person and sets the mood for music describing the feelings he has experienced throughout his life. Amid the chaos, there is beauty and hope for humanity.',
        true),
       ('Вопреки — это несмотря ни на что… Несмотря на то, что обстоятельства вынуждают человека поступать одним образом, он поступает иначе, вопреки всем обстоятельствам.',
        true),
       ('Как и на первой пластинке, юмора будет предостаточно, разница лишь в том, что он будет более завуалированным. Ведь каждый любит вуаль.',
        false),
       ('Blurryface embodies all my fears and complexes and is an immaterial entity living inside, which makes me feel insecure in my creativity and in what I create',
        true),
       ('Я решил напечатать две тысячи плакатов и заклеить ими весь город, чтобы люди натыкались на них везде: в метро, во дворах и на заборах. Это не было рекламным трюком, хотя и могло сработать, как реклама. Если бы я в течение месяца натыкался бы на это слово, а потом, зайдя в магазин, увидел бы альбом с такой картинкой и таким названием, то я обязательно из любопытства его купил бы.',
        true),
       ('В нашей крови, в самых глубинах нашего существа сохраняется непреодолимым наследие древних времён; но я говорю не о первобытной жестокости и животных инстинктах, которые приписывают нам жидовский психоанализ и эволюционизм: это наследие древних, мифических времён, это наследие света.',
        true),
       ('Их музыка - революционна и стихийна, но в ней, в то же время, ощущается угрюмая, меланхолическая опасность; будучи по своей сути пост-дарквэйв группой, Shortparis обладает достаточной харизмой, чтобы собрать стадион подобно Depeche Mode',
        true),
       ('That me in the corner. That me in the spotlight', false),
       ('Пятый студийный альбом американского рэпера 50 Cent, который был выпущен 3 июня 2014 года лейблами G-Unit Records и Caroline Records. Продюсерами альбома стали 50 Cent (исполнительный), Frank Dukes, Charli Brown Beatz, Swiff D, Shamtrax, Dr. Dre, Dawaun Parker, Mark Batson, Steve Alien, G Rocka, Medi, Jake One, JustHustle, Kyle Justice, Ky Miller, Ty Fyffe, Soul Professa, Nascent, QB. Гостями альбома стали музыканты Yo Gotti, Trey Songz, Kidd Kidd, Jadakiss, Mr Probz, Guordan Banks, Prodigy, Schoolboy Q и Styles P.',
        false),
       ('The Way I Am — автобиография американского рэпера Эминема. Книга была впервые опубликована 21 октября 2008 под редакцией Dutton Adult. Это сборник Эминема, в который входят личные истории, размышления, фотографии, оригинальные рисунки и тексты.',
        false),
       ('Recovery — седьмой студийный альбом американского рэпера Эминема, издан в 2010 году. Самый продаваемый альбом 2010 года в США. Выход Recovery был подтвержден во время пресс-релиза Эминема, состоявшегося 5 марта 2009, и альбом был первоначально назван Relapse 2.',
        false),
       ('Вокалист Дэн Рейнольдс рассказывал, что «Mercury – Act 1» – концептуальная пластинка с двумя сторонами: «органичной внутренней» и «агрессивной внешней».',
        false),
       ('Origins — четвёртый студийный альбом американской рок-группы Imagine Dragons, релиз которого состоялся 9 ноября 2018 года.',
        false),
       ('Smoke + Mirrors - второй студийный альбом американской поп-рок-группы Imagine Dragons. Альбом был записан в 2014 году на домашней студии группы в Лас-Вегасе, штат Невада.',
        true),
       ('Mr. Morale & the Big Steppers представляет собой двойной альбом, состоящий из 18 песен, разделенных на две части по девять треков. Тематика пластинки посвящена социальным, созерцательным и религиозным темам, таким как социальные сети и культура отмены, капитализм, отцовство, христианство и романтика',
        false),
       ('«Мы не хотели утратить того, что люди ценили в нашей музыке. Но с другой стороны, мы не хотели делать трилогию. Не хотели выдавать альбом, звучание которого люди могли предугадать», — вспоминал Честер Беннингтон. «Если вы все-таки скачали песни, окажите нам большую услугу — слушайте их в правильном порядке, это будет более стоящим»',
        false),
       ('В записи альбома участвовали такие музыканты, как Kiiara (вокал в «Heavy»), Pusha T и Stormzy (оба перечисленных музыканта исполнили куплеты в «Good Goodbye»). One More Light оказался последним альбомом Linkin Park, в записи которого принял участие Честер Беннингтон',
        false),
       ('"Есть два понятия горизонта событий: одно имеет отношение к сингулярности космоса, другое, негативное — к психологии. Если вы «прогуглите», вы поймёте. Позитивный элемент — это точка, где замирает время."-Шура Би-2',
        false),
       ('«Когда мы выпустили альбом „Думаешь, это конец?“, у нас появилось чувство недосказанности, — признается Роман Варнин. — К тому же многое из невыпущенного лежало в закромах. Мы подумали, так как это все-таки наш последний совместный альбом, почему бы не сделать делюкс-версию и не дополнить ее полноценной историей с материалом из недалекого прошлого? Делюкс-версия получилась очень эклектичной и, на наш взгляд, как раз таки завершенной. Здесь мы высказываемся в полном объеме, не скрывая от вас ничего».',
        false),
       ('Самые популярные синглы Аллы Пугачевой',
        false)
;
--


-- tracks
INSERT INTO Track (album_id, artist_id, title, duration, count_likes, count_listening)
VALUES (1, 1, 'Youre My Best Friend', 172, 0, 0),                                     -- 1
       (1, 1, 'Love Of My Life', 217, 0, 0),                                          -- 2
       (1, 1, 'Bohemian Rhapsody', 355, 0, 0),                                        -- 3
       (1, 1, 'Keep Yourself Alive', 244, 0, 0),                                      -- 4

       (2, 2, 'Профессионал', 219, 0, 0),                                             -- 5
       (2, 2, 'Люди', 162, 0, 0),                                                     -- 6
       (2, 2, 'Альтернатива', 230, 0, 0),                                             -- 7
       (2, 2, 'Ретро', 107, 0, 0),                                                    -- 8

       (3, 3, 'Speak To Me', 90, 0, 0),                                               -- 9
       (3, 3, 'The Great Gig in the Sky', 276, 0, 0),                                 -- 10
       (3, 3, 'Money', 382, 0, 0),                                                    -- 11
       (3, 3, 'Us And Them', 423, 0, 0),                                              -- 12

       (4, 4, 'Параллельные', 227, 0, 0),                                             -- 13
       (4, 4, 'Ей никогда не быть моей', 255, 0, 0),                                  -- 14
       (4, 4, 'Иностранец', 246, 0, 0),                                               -- 15
       (4, 4, 'Вопреки', 265, 0, 0),                                                  -- 16

       (5, 5, 'Самый лучший друг', 165, 0, 0),                                        -- 17
       (5, 5, 'Все мои друзья', 160, 0, 0),                                           -- 18
       (5, 5, 'Космос нас ждёт', 202, 0, 0),                                          -- 19
       (5, 5, 'Кладбище самолётов', 352, 0, 0),                                       -- 20
       (5, 5, 'Улица Сталеваров', 258, 0, 0),                                         -- 21

       (6, 6, 'Heavydirtysoul', 234, 0, 0),                                           -- 22
       (6, 6, 'Stressed Out', 202, 100, 0),                                           -- 23
       (6, 6, 'Ride', 214, 0, 0),                                                     -- 24

       (7, 7, 'Пётр', 135, 0, 0),                                                     -- 25
       (7, 7, 'Ай-лю-ли', 187, 0, 0),                                                 -- 26
       (7, 7, 'Зайцы', 221, 0, 0),                                                    -- 27
       (7, 7, 'Вороны', 207, 0, 0),                                                   -- 28

       (8, 8, 'Дорадура', 134, 0, 0),                                                 -- 29
       (8, 8, 'Младшая сестра', 222, 0, 0),                                           -- 30
       (8, 8, 'Подружки', 142, 0, 0),                                                 -- 31
       (8, 8, 'Задолбал меня игнорить', 179, 0, 0),                                   -- 32

       (9, 9, 'Поломало', 275, 0, 0),                                                 -- 33
       (9, 9, 'Стыд', 268, 0, 0),                                                     -- 34
       (9, 9, 'Страшно', 289, 0, 0),                                                  -- 35
       (9, 9, 'Так закалялась сталь', 247, 0, 0),                                     -- 36

       (10, 10, 'Radio Song', 252, 0, 0),                                             -- 37
       (10, 10, 'Losing My Religion', 266, 0, 0),                                     -- 38
       (10, 10, 'Low', 295, 0, 0),                                                    -- 39

       (11, 11, 'Animal Ambition', 188, 0, 0),                                        -- 40
       (11, 11, 'Winners Circle (feat. Guordan Bancks)', 203, 0, 0),                  -- 41
       (11, 11, 'Irregular Hearbear (feat. Jadakiss & Kidd Kidd)', 219, 0, 0),        -- 42
       (11, 11, 'Everytime i Come Around (feat. Kidd Kidd)', 190, 0, 0),              -- 43
       (11, 11, 'Twisted (feat. mr. Probz)', 194, 0, 0),                              -- 44
       (11, 11, 'Chase the Paper (feat. Prodigy, Kidd Kidd & Styles P)', 254, 0, 0),  -- 45
       (11, 11, 'Smoke (feat. Trey Songz)', 231, 0, 0),                               -- 46
       (11, 11, 'Hold On', 226, 0, 0),                                                -- 47
       (11, 11, 'Hustler', 185, 0, 0),                                                -- 48
       (11, 11, 'Pilot', 200, 0, 0),                                                  -- 49
       (11, 11, 'The Funeral', 199, 0, 0),                                            -- 50
       (11, 11, 'Dont Worry Bout It (feat. Yo Gotti)', 241, 0, 0),                    -- 51

       (12, 12, 'Airplanes', 296, 0, 0),                                              -- 52
       (12, 12, 'Atlanta on Fire', 252, 0, 0),                                        -- 53
       (12, 12, 'Bangers (Freestyle)', 74, 0, 0),                                     -- 54
       (12, 12, 'Chemical Warfare', 95, 0, 0),                                        -- 55
       (12, 12, 'Crack A Bottle', 288, 0, 0),                                         -- 56
       (12, 12, 'Despicable (Freestyle)', 132, 0, 0),                                 -- 57
       (12, 12, 'Drop it Like It''s Hot (Freestyle)', 53, 0, 0),                      -- 58
       (12, 12, 'Drop the Bomb on Em', 265, 0, 0),                                    -- 59
       (12, 12, 'Drop the World', 226, 0, 0),                                         -- 60
       (12, 12, 'Elevator', 270, 0, 0),                                               -- 61
       (12, 12, 'Lose Yourself (Remix)', 275, 0, 0),                                  -- 62
       (12, 12, 'Forever', 352, 0, 0),                                                -- 63
       (12, 12, 'Hell Breaks Loose', 229, 0, 0),                                      -- 64
       (12, 12, 'I will Hurt You', 243, 0, 0),                                        -- 65
       (12, 12, 'Not afraid', 247, 0, 0),                                             -- 66
       (12, 12, 'Psycho', 274, 0, 0),                                                 -- 67
       (12, 12, 'Renegade', 215, 0, 0),                                               -- 68
       (12, 12, 'Taking My Ball', 286, 0, 0),                                         -- 69
       (12, 12, 'The Rulers Back (Ja Rule Diss)', 136, 0, 0),                         -- 70
       (12, 12, 'Touchdown', 267, 0, 0),                                              -- 71
       (12, 12, 'Welcome to D-Block', 250, 0, 0),                                     -- 72

       (13, 12, '25 To Life', 241, 0, 0),                                             -- 73
       (13, 12, 'Almost Famous', 292, 0, 0),                                          -- 74
       (13, 12, 'Cinderella Man', 279, 0, 0),                                         -- 75
       (13, 12, 'Cold Wind Blows', 303, 0, 0),                                        -- 76
       (13, 12, 'Talkin 2 Myself (feat. Kobe)', 300, 0, 0),                           -- 77
       (13, 12, 'No Love (feat. Lil Wayne)', 299, 0, 0),                              -- 78
       (13, 12, 'Wont back down (feat. Pink)', 265, 0, 0),                            -- 79
       (13, 12, 'Going Through Changes', 298, 0, 0),                                  -- 80
       (13, 12, 'Im On Fire', 213, 0, 0),                                             -- 81
       (13, 12, 'Not afraid', 248, 0, 0),                                             -- 82
       (13, 12, 'Love the way you lie (feat. Rihanna)', 263, 0, 0),                   -- 83
       (13, 12, 'Seduction', 275, 0, 0),                                              -- 84
       (13, 12, 'So Far', 325, 0, 0),                                                 -- 85
       (13, 12, 'Space bound', 278, 0, 0),                                            -- 86
       (13, 12, 'Untitled', 194, 0, 0),                                               -- 87
       (13, 12, 'W.T.P', 238, 0, 0),                                                  -- 88
       (13, 12, 'You are Never Over', 305, 0, 0),                                     -- 89

       (14, 13, '#1', 205, 0, 0),                                                     -- 90
       (14, 13, 'Cutthroat', 169, 0, 0),                                              -- 91
       (14, 13, 'Dull Knives', 213, 0, 0),                                            -- 92
       (14, 13, 'Easy Come Easy Go', 179, 0, 0),                                      -- 93
       (14, 13, 'Follow You', 175, 0, 0),                                             -- 94
       (14, 13, 'Giants', 210, 0, 0),                                                 -- 95
       (14, 13, 'It is Ok', 202, 0, 0),                                               -- 96
       (14, 13, 'Lonely', 159, 0, 0),                                                 -- 97
       (14, 13, 'Monday', 187, 0, 0),                                                 -- 98
       (14, 13, 'My Life', 224, 0, 0),                                                -- 99
       (14, 13, 'No Time For Toxic People', 207, 0, 0),                               -- 100
       (14, 13, 'One Day', 151, 0, 0),                                                -- 101
       (14, 13, 'Wrecked', 244, 0, 0),                                                -- 102

       (15, 13, 'Bad Liar', 260, 0, 0),                                               -- 103
       (15, 13, 'Birds', 219, 0, 0),                                                  -- 104
       (15, 13, 'Boomerang', 187, 0, 0),                                              -- 105
       (15, 13, 'Bullet In A Gun', 204, 0, 0),                                        -- 106
       (15, 13, 'Burn Out', 273, 0, 0),                                               -- 107
       (15, 13, 'Cool Out', 217, 0, 0),                                               -- 108
       (15, 13, 'Digital', 201, 0, 0),                                                -- 109
       (15, 13, 'Love', 166, 0, 0),                                                   -- 110
       (15, 13, 'Machine', 181, 0, 0),                                                -- 111
       (15, 13, 'Natural', 189, 0, 0),                                                -- 112
       (15, 13, 'Only', 180, 0, 0),                                                   -- 113
       (15, 13, 'Real Life', 247, 0, 0),                                              -- 114
       (15, 13, 'Stuck', 190, 0, 0),                                                  -- 115
       (15, 13, 'West Coast', 217, 0, 0),                                             -- 116
       (15, 13, 'Zero', 211, 0, 0),                                                   -- 117

       (16, 13, 'Dream', 258, 0, 0),                                                  -- 118
       (16, 13, 'Friction', 202, 0, 0),                                               -- 119
       (16, 13, 'Gold', 217, 0, 0),                                                   -- 120
       (16, 13, 'Hopeless Opus', 239, 0, 0),                                          -- 121
       (16, 13, 'I Bet My Life', 192, 0, 0),                                          -- 122
       (16, 13, 'Im So Sorry', 230, 0, 0),                                            -- 123
       (16, 13, 'It Comes Back To You', 217, 0, 0),                                   -- 124
       (16, 13, 'Polaroid', 230, 0, 0),                                               -- 125
       (16, 13, 'Release', 148, 0, 0),                                                -- 126
       (16, 13, 'Second Chances', 218, 0, 0),                                         -- 127
       (16, 13, 'Shots', 232, 0, 0),                                                  -- 128
       (16, 13, 'Smoke & Mirrors', 261, 0, 0),                                        -- 129
       (16, 13, 'Summer', 218, 0, 0),                                                 -- 130
       (16, 13, 'The Fall', 362, 0, 0),                                               -- 131
       (16, 13, 'The Unknown', 204, 0, 0),                                            -- 132
       (16, 13, 'Thief', 227, 0, 0),                                                  -- 133
       (16, 13, 'Trouble', 191, 0, 0),                                                -- 134
       (16, 13, 'Warriors', 170, 0, 0),                                               -- 135

       (17, 14, 'Auntie Diaries', 281, 0, 0),                                         -- 136
       (17, 14, 'Count Me Out', 283, 0, 0),                                           -- 137
       (17, 14, 'Crown', 264, 0, 0),                                                  -- 138
       (17, 14, 'Savior (feat. Baby Keem & Sam Dew)', 224, 0, 0),                     -- 139
       (17, 14, 'Mother I Sober (feat. Beth Gibbons)', 406, 0, 0),                    -- 140
       (17, 14, 'Die Hard (feat. Blxst & Amanda Reife)', 239, 0, 0),                  -- 141
       (17, 14, 'Silent Hill (feat. Kodak Black)', 220, 0, 0),                        -- 142
       (17, 14, 'Father Time (feat. Sampha)', 222, 0, 0),                             -- 143
       (17, 14, 'Purple Hearts (feat. Summer Walker & Ghostface Killah)', 329, 0, 0), -- 144
       (17, 14, 'Mr. Morale (feat. Tanna Leone)', 210, 0, 0),                         -- 145
       (17, 14, 'We Cry Together (feat. Taylour Paige)', 341, 0, 0),                  -- 146
       (17, 14, 'Mirror', 256, 0, 0),                                                 -- 147
       (17, 14, 'N95', 196, 0, 0),                                                    -- 148
       (17, 14, 'Rich (Interlude)', 103, 0, 0),                                       -- 149
       (17, 14, 'Rich Spirit', 202, 0, 0),                                            -- 150
       (17, 14, 'Savior (Interlude)', 153, 0, 0),                                     -- 151
       (17, 14, 'United In Grief', 255, 0, 0),                                        -- 152
       (17, 14, 'Worldwide Steppers', 203, 0, 0),                                     -- 153

       (18, 15, 'Bleed It Out', 164, 0, 0),                                           -- 154
       (18, 15, 'Given Up', 189, 0, 0),                                               -- 155
       (18, 15, 'Hands Held High', 233, 0, 0),                                        -- 156
       (18, 15, 'In Between', 196, 0, 0),                                             -- 157
       (18, 15, 'In Pieces', 218, 0, 0),                                              -- 158
       (18, 15, 'Leave Out All the Rest', 209, 0, 0),                                 -- 159
       (18, 15, 'No More Sorrow', 221, 0, 0),                                         -- 160
       (18, 15, 'Shadow of the Day', 289, 0, 0),                                      -- 161
       (18, 15, 'The Little Things Give You Away', 383, 0, 0),                        -- 162
       (18, 15, 'Valentines Day', 196, 0, 0),                                         -- 163
       (18, 15, 'Wake', 100, 0, 0),                                                   -- 164
       (18, 15, 'What I have Done', 205, 0, 0),                                       -- 165

       (19, 15, 'Battle Symphony', 216, 0, 0),                                        -- 166
       (19, 15, 'Heavy (feat. Kiiara)', 170, 0, 0),                                   -- 167
       (19, 15, 'Good Goodbye (feat. Pusha T & Stormzy)', 211, 0, 0),                 -- 168
       (19, 15, 'Halfway Right', 217, 0, 0),                                          -- 169
       (19, 15, 'Invisible', 214, 0, 0),                                              -- 170
       (19, 15, 'Nobody Can Save Me', 226, 0, 0),                                     -- 171
       (19, 15, 'One More Light', 255, 0, 0),                                         -- 172
       (19, 15, 'Sharp Edges', 178, 0, 0),                                            -- 173
       (19, 15, 'Sorry for Now', 204, 0, 0),                                          -- 174
       (19, 15, 'Talking to Myself', 231, 0, 0),                                      -- 175

       (20, 16, 'Виски (feat. John Grant)', 197, 0, 0),                               -- 176
       (20, 16, 'Иначе (feat. John Grant)', 247, 0, 0),                               -- 177
       (20, 16, 'Пора Возвращаться Домой (feat. Oxxxymiron)', 289, 0, 0),             -- 178
       (20, 16, 'Хороводная (feat. Виктор Сологуб & Mana Island)', 244, 0, 0),        -- 179
       (20, 16, 'ХалиГалиКришна (feat. Глеб Самойлов)', 246, 0, 0),                   -- 180
       (20, 16, 'Дебют (feat. Олег Нестеров)', 368, 0, 0),                            -- 181
       (20, 16, 'Алиса', 221, 0, 0),                                                  -- 182
       (20, 16, 'Детство', 194, 0, 0),                                                -- 183
       (20, 16, 'Лайки', 211, 0, 0),                                                  -- 184
       (20, 16, 'Летчик', 351, 0, 0),                                                 -- 185
       (20, 16, 'Пофигу', 201, 0, 0),                                                 -- 186
       (20, 16, 'Птица на подоконнике', 326, 0, 0),                                   -- 187
       (20, 16, 'Родина', 326, 0, 0),                                                 -- 188
       (20, 16, 'Тема века', 218, 0, 0),                                              -- 189
       (20, 16, 'Философский Камень', 286, 0, 0),                                     -- 190
       (20, 16, 'Черное солнце', 289, 0, 0),                                          -- 191

       (21, 17, '5 Дней', 259, 0, 0),                                                 -- 192
       (21, 17, 'Interlude', 90, 0, 0),                                               -- 193
       (21, 17, 'Skit', 75, 0, 0),                                                    -- 194
       (21, 17, 'Без Ран', 213, 0, 0),                                                -- 195
       (21, 17, 'Больше Слов Не Надо', 251, 0, 0),                                    -- 196
       (21, 17, 'В Этом Городе', 351, 0, 0),                                          -- 197
       (21, 17, 'Любовь В Войну', 264, 0, 0),                                         -- 198
       (21, 17, 'Мармелад', 231, 0, 0),                                               -- 199
       (21, 17, 'Мне Важно', 199, 0, 0),                                              -- 200
       (21, 17, 'Мне Важно (Shumno Remix)', 202, 0, 0),                               -- 201
       (21, 17, 'Не Покидай', 226, 0, 0),                                             -- 202
       (21, 17, 'Никто Не Виноват', 210, 0, 0),                                       -- 203
       (21, 17, 'Песок', 177, 0, 0),                                                  -- 204
       (21, 17, 'Салюты', 236, 0, 0),                                                 -- 205
       (21, 17, 'Сигнализация', 197, 0, 0),                                           -- 206
       (21, 17, 'Слезы Вытирай', 158, 0, 0),                                          -- 207
       (21, 17, 'Совпадения Случайны', 211, 0, 0),                                    -- 208
       (21, 17, 'Тайна', 188, 0, 0),                                                  -- 209
       (21, 17, 'Шазам', 244, 0, 0),                                                  -- 210

       (22, 18, 'Айсберг', 269, 0, 0),                                                -- 211
       (22, 18, 'Этот мир', 185, 0, 0),                                               -- 212
       (22, 18, 'Любовь, похожая на сон', 298, 0, 0),                                 -- 213
       (22, 18, 'Миллион аллых роз', 353, 0, 0),                                      -- 214
       (22, 18, 'Не делайте мне больно, господа', 206, 0, 0),                         -- 215
       (22, 18, 'Позови меня с собой', 259, 0, 0); -- 216


CREATE INDEX album_search_ru
    ON album
        USING gin (to_tsvector('russian', "title"));
CREATE INDEX album_search_en
    ON album
        USING gin (to_tsvector('english', "title"));
CREATE INDEX album_search_fr
    ON album
        USING gin (to_tsvector('french', "title"));

CREATE INDEX track_search_ru
    ON track
        USING gin (to_tsvector('russian', "title"));
CREATE INDEX track_search_en
    ON track
        USING gin (to_tsvector('english', "title"));
CREATE INDEX track_search_fr
    ON track
        USING gin (to_tsvector('french', "title"));

